<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <meta http-equiv="X-UA-Compatible" content="IE=edge" >
  <title>关于分布式一致性的探究 | Chenjh Code</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x968F;&amp;#x7740;&amp;#x5927;&amp;#x578B;&amp;#x7F51;&amp;#x7AD9;&amp;#x7684;&amp;#x5404;&amp;#x79CD;&amp;#x9AD8;&amp;#x5E76;&amp;#x53D1;&amp;#x8BBF;&amp;#x95EE;&amp;#x3001;&amp;#x6D77;&amp;#x91CF;&amp;#x6570;&amp;#x636E;&amp;#x5904;&amp;#x7406;&amp;#x7B49;&amp;#x573A;&amp;#x666F;&amp;#x8D8A;">
<meta property="og:type" content="article">
<meta property="og:title" content="关于分布式一致性的探究">
<meta property="og:url" content="http://code.skyheng.com/2016/08/08/关于分布式一致性的探究/index.html">
<meta property="og:site_name" content="Chenjh Code">
<meta property="og:description" content="&amp;#x968F;&amp;#x7740;&amp;#x5927;&amp;#x578B;&amp;#x7F51;&amp;#x7AD9;&amp;#x7684;&amp;#x5404;&amp;#x79CD;&amp;#x9AD8;&amp;#x5E76;&amp;#x53D1;&amp;#x8BBF;&amp;#x95EE;&amp;#x3001;&amp;#x6D77;&amp;#x91CF;&amp;#x6570;&amp;#x636E;&amp;#x5904;&amp;#x7406;&amp;#x7B49;&amp;#x573A;&amp;#x666F;&amp;#x8D8A;">
<meta property="og:updated_time" content="2016-08-21T15:00:54.325Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="关于分布式一致性的探究">
<meta name="twitter:description" content="&amp;#x968F;&amp;#x7740;&amp;#x5927;&amp;#x578B;&amp;#x7F51;&amp;#x7AD9;&amp;#x7684;&amp;#x5404;&amp;#x79CD;&amp;#x9AD8;&amp;#x5E76;&amp;#x53D1;&amp;#x8BBF;&amp;#x95EE;&amp;#x3001;&amp;#x6D77;&amp;#x91CF;&amp;#x6570;&amp;#x636E;&amp;#x5904;&amp;#x7406;&amp;#x7B49;&amp;#x573A;&amp;#x666F;&amp;#x8D8A;">
  
    <link rel="alternative" href="/atom.xml" title="Chenjh Code" type="application/atom+xml">
  
  
    <link rel="icon" href="//favicon.png">
  
  <link rel="stylesheet" href="/css/style.css">
</head>

<body>
  <div id="container">
    <div class="left-col">
    <div class="overlay"></div>
<div class="intrude-less">
	<header id="header" class="inner">
		<a href="/" class="profilepic">
			
			<img lazy-src="0" class="js-avatar">
			
		</a>

		<hgroup>
		  <h1 class="header-author"><a href="/">Chenjh</a></h1>
		</hgroup>

		
		<p class="header-subtitle">这里只有代码相关，要了解更多 &gt;&gt;&gt; www.skyheng.com</p>
		

		
			<div class="switch-btn">
				<div class="icon">
					<div class="icon-ctn">
						<div class="icon-wrap icon-house" data-idx="0">
							<div class="birdhouse"></div>
							<div class="birdhouse_holes"></div>
						</div>
						<div class="icon-wrap icon-ribbon hide" data-idx="1">
							<div class="ribbon"></div>
						</div>
						
						<div class="icon-wrap icon-link hide" data-idx="2">
							<div class="loopback_l"></div>
							<div class="loopback_r"></div>
						</div>
						
						
						<div class="icon-wrap icon-me hide" data-idx="3">
							<div class="user"></div>
							<div class="shoulder"></div>
						</div>
						
					</div>
					
				</div>
				<div class="tips-box hide">
					<div class="tips-arrow"></div>
					<ul class="tips-inner">
						<li>Menu</li>
						<li>Tags</li>
						
						<li>Links</li>
						
						
						<li>Über</li>
						
					</ul>
				</div>
			</div>
		

		<div class="switch-area">
			<div class="switch-wrap">
				<section class="switch-part switch-part1">
					<nav class="header-menu">
						<ul>
						
							<li><a href="/">主页</a></li>
				        
							<li><a href="/archives">所有文章</a></li>
				        
						</ul>
					</nav>
					<nav class="header-nav">
						<div class="social">
							
								<a class="github" target="_blank" href="#" title="github">github</a>
					        
								<a class="weibo" target="_blank" href="#" title="weibo">weibo</a>
					        
								<a class="rss" target="_blank" href="#" title="rss">rss</a>
					        
								<a class="zhihu" target="_blank" href="#" title="zhihu">zhihu</a>
					        
						</div>
					</nav>
				</section>
				
				
				<section class="switch-part switch-part2">
					<div class="widget tagcloud" id="js-tagcloud">
						<a href="/tags/CI/" style="font-size: 10px;">CI</a> <a href="/tags/CentOS/" style="font-size: 17.5px;">CentOS</a> <a href="/tags/Excel/" style="font-size: 10px;">Excel</a> <a href="/tags/Git/" style="font-size: 12.5px;">Git</a> <a href="/tags/Github/" style="font-size: 12.5px;">Github</a> <a href="/tags/Hexo/" style="font-size: 15px;">Hexo</a> <a href="/tags/JAVA/" style="font-size: 10px;">JAVA</a> <a href="/tags/JDK/" style="font-size: 10px;">JDK</a> <a href="/tags/JRebel/" style="font-size: 10px;">JRebel</a> <a href="/tags/Java/" style="font-size: 12.5px;">Java</a> <a href="/tags/JavaScript/" style="font-size: 10px;">JavaScript</a> <a href="/tags/Markdown/" style="font-size: 10px;">Markdown</a> <a href="/tags/Maven/" style="font-size: 15px;">Maven</a> <a href="/tags/Mysql/" style="font-size: 10px;">Mysql</a> <a href="/tags/Nexus/" style="font-size: 10px;">Nexus</a> <a href="/tags/Node-js/" style="font-size: 10px;">Node.js</a> <a href="/tags/SQL/" style="font-size: 10px;">SQL</a> <a href="/tags/SVN/" style="font-size: 12.5px;">SVN</a> <a href="/tags/Table/" style="font-size: 10px;">Table</a> <a href="/tags/Tomcat/" style="font-size: 10px;">Tomcat</a> <a href="/tags/ajax/" style="font-size: 10px;">ajax</a> <a href="/tags/dubbo/" style="font-size: 10px;">dubbo</a> <a href="/tags/eclipse/" style="font-size: 15px;">eclipse</a> <a href="/tags/git/" style="font-size: 10px;">git</a> <a href="/tags/java/" style="font-size: 10px;">java</a> <a href="/tags/jquery/" style="font-size: 10px;">jquery</a> <a href="/tags/linux/" style="font-size: 20px;">linux</a> <a href="/tags/plugin/" style="font-size: 10px;">plugin</a> <a href="/tags/分布式/" style="font-size: 10px;">分布式</a> <a href="/tags/刷卡支付/" style="font-size: 12.5px;">刷卡支付</a> <a href="/tags/学习方法/" style="font-size: 10px;">学习方法</a> <a href="/tags/开发工具/" style="font-size: 10px;">开发工具</a> <a href="/tags/微信支付/" style="font-size: 12.5px;">微信支付</a> <a href="/tags/数据库/" style="font-size: 10px;">数据库</a> <a href="/tags/版本管理/" style="font-size: 10px;">版本管理</a>
					</div>
				</section>
				
				
				
				<section class="switch-part switch-part3">
					<div id="js-friends">
					
			          <a target="_blank" class="main-nav-link switch-friends-link" href="http://localhost:4000/">奥巴马的博客</a>
			        
			          <a target="_blank" class="main-nav-link switch-friends-link" href="http://localhost:4000/">卡卡的美丽传说</a>
			        
			          <a target="_blank" class="main-nav-link switch-friends-link" href="http://localhost:4000/">本泽马的博客</a>
			        
			          <a target="_blank" class="main-nav-link switch-friends-link" href="http://localhost:4000/">吉格斯的博客</a>
			        
			          <a target="_blank" class="main-nav-link switch-friends-link" href="http://localhost:4000/">习大大大不同</a>
			        
			          <a target="_blank" class="main-nav-link switch-friends-link" href="http://localhost:4000/">托蒂的博客</a>
			        
			        </div>
				</section>
				

				
				
				<section class="switch-part switch-part4">
				
					<div id="js-aboutme">我是谁，我从哪里来，我到哪里去？我就是我，是颜色不一样的吃货…</div>
				</section>
				
			</div>
		</div>
	</header>				
</div>

    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
  	<div class="overlay">
  		<div class="slider-trigger"></div>
  		<h1 class="header-author js-mobile-header hide">Chenjh</h1>
  	</div>
	<div class="intrude-less">
		<header id="header" class="inner">
			<div class="profilepic">
				
					<img lazy-src="0" class="js-avatar">
				
			</div>
			<hgroup>
			  <h1 class="header-author">Chenjh</h1>
			</hgroup>
			
			<p class="header-subtitle">这里只有代码相关，要了解更多 &gt;&gt;&gt; www.skyheng.com</p>
			
			<nav class="header-menu">
				<ul>
				
					<li><a href="/">主页</a></li>
		        
					<li><a href="/archives">所有文章</a></li>
		        
		        <div class="clearfix"></div>
				</ul>
			</nav>
			<nav class="header-nav">
				<div class="social">
					
						<a class="github" target="_blank" href="#" title="github">github</a>
			        
						<a class="weibo" target="_blank" href="#" title="weibo">weibo</a>
			        
						<a class="rss" target="_blank" href="#" title="rss">rss</a>
			        
						<a class="zhihu" target="_blank" href="#" title="zhihu">zhihu</a>
			        
				</div>
			</nav>
		</header>				
	</div>
</nav>

      <div class="body-wrap"><article id="post-关于分布式一致性的探究" class="article article-type-post" itemscope itemprop="blogPost">
  
    <div class="article-meta">
      <a href="/2016/08/08/关于分布式一致性的探究/" class="article-date">
  	<time datetime="2016-08-08T15:21:25.000Z" itemprop="datePublished">2016-08-08</time>
</a>
    </div>
  
  <div class="article-inner">
    
      <input type="hidden" class="isFancy" />
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      关于分布式一致性的探究
    </h1>
  

      </header>
      
      <div class="article-info article-info-post">
        
        

        <div class="clearfix"></div>
      </div>
      
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>&#x968F;&#x7740;&#x5927;&#x578B;&#x7F51;&#x7AD9;&#x7684;&#x5404;&#x79CD;&#x9AD8;&#x5E76;&#x53D1;&#x8BBF;&#x95EE;&#x3001;&#x6D77;&#x91CF;&#x6570;&#x636E;&#x5904;&#x7406;&#x7B49;&#x573A;&#x666F;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x7F51;&#x7AD9;&#x7684;&#x9AD8;&#x53EF;&#x7528;&#x3001;&#x6613;&#x4F38;&#x7F29;&#x3001;&#x53EF;&#x6269;&#x5C55;&#x3001;&#x5B89;&#x5168;&#x7B49;&#x76EE;&#x6807;&#x5C31;&#x663E;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x91CD;&#x8981;&#x3002;<br>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x6837;&#x4E00;&#x7CFB;&#x5217;&#x95EE;&#x9898;&#xFF0C;&#x5927;&#x578B;&#x7F51;&#x7AD9;&#x7684;&#x67B6;&#x6784;&#x4E5F;&#x5728;&#x4E0D;&#x65AD;&#x53D1;&#x5C55;&#x3002;&#x63D0;&#x9AD8;&#x5927;&#x578B;&#x7F51;&#x7AD9;&#x7684;&#x9AD8;&#x53EF;&#x7528;&#x67B6;&#x6784;&#xFF0C;&#x4E0D;&#x5F97;&#x4E0D;&#x63D0;&#x7684;&#x5C31;&#x662F;&#x5206;&#x5E03;&#x5F0F;&#x3002;<br>&#x5728;&#x521D;&#x8BC6;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E00;&#x6587;&#x4E2D;&#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#x4E86;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#xFF0C;&#x672C;&#x6587;&#x5C06;&#x5728;&#x4E0A;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x7EE7;&#x7EED;&#x5B66;&#x4E60;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x95EE;&#x9898;&#x3002;<br>&#x4E3B;&#x8981;&#x4ECB;&#x7ECD;&#x5206;&#x5E03;&#x5F0F;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x3001;&#x91CD;&#x8981;&#x6027;&#x3001;&#x4E00;&#x81F4;&#x6027;&#x6A21;&#x578B;&#x7B49;&#x3002;</p>
<a id="more"></a>
<h2 id="&#x4E00;&#x81F4;&#x6027;&#x7684;&#x91CD;&#x8981;&#x6027;"><a href="#&#x4E00;&#x81F4;&#x6027;&#x7684;&#x91CD;&#x8981;&#x6027;" class="headerlink" title="&#x4E00;&#x81F4;&#x6027;&#x7684;&#x91CD;&#x8981;&#x6027;"></a>&#x4E00;&#x81F4;&#x6027;&#x7684;&#x91CD;&#x8981;&#x6027;</h2><p>&#x5206;&#x5E03;&#x5F0F;&#x9886;&#x57DF;CAP&#x7406;&#x8BBA;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#xFF0C;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x90FD;&#x65E0;&#x6CD5;&#x540C;&#x65F6;&#x6EE1;&#x8DB3;Consistency(&#x4E00;&#x81F4;&#x6027;),Availability(&#x53EF;&#x7528;&#x6027;), Partition tolerance(&#x5206;&#x533A;&#x5BB9;&#x9519;&#x6027;) &#x8FD9;&#x4E09;&#x4E2A;&#x57FA;&#x672C;&#x9700;&#x6C42;&#x3002;&#x6700;&#x591A;&#x53EA;&#x80FD;&#x6EE1;&#x8DB3;&#x5176;&#x4E2D;&#x4E24;&#x9879;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x65E0;&#x8BBA;&#x5728;CAP&#x4E09;&#x8005;&#x4E4B;&#x95F4;&#x5982;&#x4F55;&#x6743;&#x8861;&#xFF0C;&#x90FD;&#x65E0;&#x6CD5;&#x5F7B;&#x5E95;&#x653E;&#x5F03;&#x4E00;&#x81F4;&#x6027;&#xFF08;Consistency&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x771F;&#x7684;&#x653E;&#x5F03;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x8BF4;&#x660E;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x6839;&#x672C;&#x4E0D;&#x53EF;&#x4FE1;&#xFF0C;&#x6570;&#x636E;&#x4E5F;&#x5C31;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E5F;&#x5C31;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4EF7;&#x503C;&#x53EF;&#x8A00;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x65E0;&#x8BBA;&#x5982;&#x4F55;&#xFF0C;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x95EE;&#x9898;&#x90FD;&#x9700;&#x8981;&#x91CD;&#x70B9;&#x5173;&#x6CE8;&#x3002;(&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;CAP&#x7406;&#x8BBA;&#x3001;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;BASE&#x7406;&#x8BBA;)</p>
<blockquote>
<p>&#x8FD9;&#x91CC;&#x5148;&#x7B80;&#x5355;&#x63D0;&#x4E00;&#x4E0B;&#xFF0C;&#x7531;&#x4E8E;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E0D;&#x53EF;&#x80FD;&#x653E;&#x5F03;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x90A3;&#x4E48;&#x4E3A;&#x4EC0;&#x4E48;&#x6709;&#x7684;&#x67B6;&#x6784;&#x5E08;&#x8FD8;&#x8BF4;&#x5728;&#x67D0;&#x4E9B;&#x573A;&#x666F;&#x4E2D;&#x53EF;&#x4EE5;&#x727A;&#x7272;&#x4E00;&#x81F4;&#x6027;&#x5462;&#xFF1F;&#x901A;&#x5E38;&#x8FD9;&#x91CC;&#x8BF4;&#x7684;&#x653E;&#x5F03;&#x4E00;&#x81F4;&#x6027;&#x6307;&#x7684;&#x662F;&#x653E;&#x5F03;&#x6570;&#x636E;&#x7684;&#x5F3A;&#x4E00;&#x81F4;&#x6027;&#xFF08;&#x540E;&#x6587;&#x4ECB;&#x7ECD;&#x4EC0;&#x4E48;&#x662F;&#x5F3A;&#x4E00;&#x81F4;&#x6027;&#xFF09;&#x3002;</p>
</blockquote>
<p>&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x6240;&#x8BF4;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x4E00;&#x81F4;&#x6027;&#x95EE;&#x9898;&#x901A;&#x5E38;&#x6307;&#x7684;&#x662F;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#x95EE;&#x9898;&#x3002;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5C31;&#x5148;&#x6765;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;&#x4EC0;&#x4E48;&#x662F;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#x3002;</p>
<h2 id="&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;"><a href="#&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;" class="headerlink" title="&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;"></a>&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;</h2><ul>
<li>&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#x5176;&#x5B9E;&#x662F;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x7684;&#x628A;&#x4E00;&#x81F4;&#x6027;&#x7406;&#x89E3;&#x4E3A;&#x6B63;&#x786E;&#x6027;&#x6216;&#x8005;&#x5B8C;&#x6574;&#x6027;&#xFF0C;&#x90A3;&#x4E48;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#x901A;&#x5E38;&#x6307;&#x5173;&#x8054;&#x6570;&#x636E;<br>&#x4E4B;&#x95F4;&#x7684;&#x903B;&#x8F91;&#x5173;&#x7CFB;&#x662F;&#x5426;&#x6B63;&#x786E;&#x548C;&#x5B8C;&#x6574;&#x3002;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x5728;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x4E2D;&#x901A;&#x5E38;&#x7528;&#x4E8B;&#x52A1;&#xFF08;&#x8BBF;&#x95EE;&#x5E76;&#x53EF;&#x80FD;&#x66F4;&#x65B0;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5404;&#x79CD;&#x6570;&#x636E;&#x9879;&#x7684;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x5355;&#x5143;&#xFF09;<br>&#x6765;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x548C;&#x5B8C;&#x6574;&#x6027;&#x3002;&#x800C;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#x5F80;&#x5F80;&#x6307;&#x7684;&#x662F;&#x7531;&#x4E8E;&#x6570;&#x636E;&#x7684;&#x590D;&#x5236;&#xFF0C;&#x4E0D;&#x540C;&#x6570;&#x636E;&#x8282;&#x70B9;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5185;&#x5BB9;&#x662F;&#x5426;&#x5B8C;&#x6574;&#x5E76;&#x4E14;&#x76F8;&#x540C;&#x3002;<br>&#x200B;- &#x6BD4;&#x5982;&#x5728;&#x96C6;&#x4E2D;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x6709;&#x4E00;&#x4E9B;&#x5173;&#x952E;&#x7684;&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#xFF0C;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4FDD;&#x5B58;&#x5728;&#x670D;&#x52A1;&#x5668;&#x7684;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5982;&#x4F55;&#x4FDD;&#x5B58;&#x8FD9;&#x4E9B;&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#xFF0C;<br>&#x53C8;&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x6240;&#x6709;&#x673A;&#x5668;&#x4E0A;&#x7684;&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#x90FD;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#xFF0C;&#x53C8;&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x4FEE;&#x6539;&#x4E00;&#x4E2A;&#x914D;&#x7F6E;&#x80FD;&#x591F;&#x628A;&#x8FD9;&#x6B21;&#x4FEE;&#x6539;&#x540C;&#x6B65;&#x5230;&#x6240;&#x6709;&#x673A;&#x5668;&#x4E2D;&#x5462;&#xFF1F;</li>
<li>&#x518D;&#x6BD4;&#x5982;&#xFF0C;&#x5728;&#x96C6;&#x4E2D;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x8FDB;&#x884C;&#x4E00;&#x4E2A;&#x540C;&#x6B65;&#x64CD;&#x4F5C;&#x8981;&#x5199;&#x540C;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x4E8B;&#x52A1;+&#x9501;&#x6765;&#x7BA1;&#x7406;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x7684;ACID&#x3002;&#x4F46;&#x662F;&#xFF0C;<br>&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x591A;&#x53F0;&#x673A;&#x5668;&#x4E0D;&#x4F1A;&#x540C;&#x65F6;&#x5199;&#x540C;&#x4E00;&#x6761;&#x6570;&#x636E;&#x5462;&#xFF1F;</li>
</ul>
<h3 id="&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x6709;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#x95EE;&#x9898;"><a href="#&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x6709;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#x95EE;&#x9898;" class="headerlink" title="&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x6709;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#x95EE;&#x9898;"></a>&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x6709;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#x95EE;&#x9898;</h3><p>&#x5728;&#x521D;&#x8BC6;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x6211;&#x4EEC;&#x4ECB;&#x7ECD;&#x8FC7;&#xFF0C;&#x867D;&#x7136;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x6709;&#x7740;&#x8BF8;&#x591A;&#x4F18;&#x70B9;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x91C7;&#x7528;&#x591A;&#x673A;&#x5668;&#x8FDB;&#x884C;&#x5206;&#x5E03;&#x5F0F;&#x90E8;&#x7F72;&#x7684;&#x65B9;&#x5F0F;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF0C;&#x5FC5;&#x7136;&#x5B58;&#x5728;&#x7740;&#x6570;&#x636E;&#x7684;&#x590D;&#x5236;&#x3002;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;&#x6570;&#x636E;&#x590D;&#x5236;&#x9700;&#x6C42;&#x4E3B;&#x8981;&#x6765;&#x6E90;&#x4E8E;&#x4EE5;&#x4E0B;&#x4E24;&#x4E2A;&#x539F;&#x56E0;&#xFF1A;</p>
<blockquote>
<p>&#x53EF;&#x7528;&#x6027;&#x3002;&#x5C06;&#x6570;&#x636E;&#x590D;&#x5236;&#x5230;&#x5206;&#x5E03;&#x5F0F;&#x90E8;&#x7F72;&#x7684;&#x591A;&#x53F0;&#x673A;&#x5668;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x6D88;&#x9664;&#x5355;&#x70B9;&#x6545;&#x969C;&#x3002;&#x9632;&#x6B62;&#x7CFB;&#x7EDF;&#x7531;&#x4E8E;&#x67D0;&#x53F0;&#xFF08;&#x4E9B;&#xFF09;&#x673A;&#x5668;&#x5B95;&#x673A;&#x5BFC;&#x81F4;&#x7684;&#x4E0D;&#x53EF;&#x7528;&#x3002;</p>
<p>&#x6027;&#x80FD;&#x3002;&#x901A;&#x8FC7;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x6280;&#x672F;&#xFF0C;&#x80FD;&#x591F;&#x8BA9;&#x5206;&#x5E03;&#x5728;&#x4E0D;&#x540C;&#x5730;&#x65B9;&#x7684;&#x6570;&#x636E;&#x526F;&#x672C;&#x5168;&#x90FD;&#x5BF9;&#x5916;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x3002;&#x6709;&#x6548;&#x63D0;&#x9AD8;&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#x3002;</p>
</blockquote>
<p>&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x5F15;&#x5165;&#x590D;&#x5236;&#x673A;&#x5236;&#x540E;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x7531;&#x4E8E;&#x7F51;&#x7EDC;&#x5EF6;&#x65F6;&#x7B49;&#x539F;&#x56E0;&#x5F88;&#x5BB9;&#x6613;&#x4EA7;&#x751F;&#x6570;&#x636E;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x590D;&#x5236;&#x673A;&#x5236;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x3002;&#x4F46;&#x662F;&#x6570;&#x636E;&#x590D;&#x5236;&#x9762;&#x4E34;&#x7684;&#x4E3B;&#x8981;&#x96BE;&#x9898;&#x4E5F;&#x662F;&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x591A;&#x4E2A;&#x526F;&#x672C;&#x4E4B;&#x95F4;&#x7684;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x6709;&#x4E24;&#x4E2A;&#x4EBA;&#x540C;&#x65F6;&#x53BB;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x706B;&#x8F66;&#x7AD9;&#x4E70;&#x7968;&#xFF08;A&#x53BB;A&#x706B;&#x8F66;&#x7AD9;&#xFF0C;B&#x53BB;B&#x706B;&#x8F66;&#x7AD9;&#xFF09;&#xFF0C;&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;&#x5408;&#x7406;&#x7684;&#x5356;&#x7968;&#xFF0C;&#x9700;&#x8981;&#x5728;A&#x706B;&#x8F66;&#x7AD9;&#x548C;B&#x706B;&#x8F66;&#x7AD9;&#x4E4B;&#x95F4;&#x5171;&#x4EAB;&#x5173;&#x4E8E;&#x5269;&#x4F59;&#x7968;&#x6570;&#x7684;&#x6570;&#x636E;&#x3002;&#x4F46;&#x662F;A&#x548C;B&#x8981;&#x4E70;&#x7684;&#x7968;&#x53EA;&#x5269;&#x4E0B;&#x4E00;&#x5F20;&#x3002;&#x4E00;&#x5F20;&#x7968;&#x5F53;&#x7136;&#x53EA;&#x80FD;&#x5356;&#x7ED9;&#x4E00;&#x4E2A;&#x4EBA;&#x3002; &#x5982;&#x679C;&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#xFF0C;&#x90A3;&#x4E48;A&#x548C;B&#x5728;&#x4E70;&#x7968;&#x7684;&#x65F6;&#x5019;&#x5E94;&#x8BE5;&#x90FD;&#x53EF;&#x4EE5;&#x4E70;&#x7968;&#x6210;&#x529F;&#xFF08;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x5728;&#x4E70;&#x7968;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F59;&#x7968;&#x6570;&#x636E;&#x90FD;&#x663E;&#x793A;&#x8FD8;&#x6709;&#x4E00;&#x5F20;&#x4F59;&#x7968;&#xFF09;&#x3002;&#x4E24;&#x4EBA;&#x5728;&#x4E70;&#x5B8C;&#x7968;&#x4E4B;&#x540E;&#xFF0C;&#x7CFB;&#x7EDF;&#x5728;&#x505A;&#x6570;&#x636E;&#x590D;&#x5236;&#x65F6;&#x53D1;&#x73B0;&#x4E00;&#x5F20;&#x7968;&#x88AB;&#x5356;&#x51FA;&#x4E86;&#x4E24;&#x6B21;&#xFF0C;&#x8FD9;&#x65F6;&#x5C31;&#x8981;&#x8BA9;A&#x548C;B&#x4E24;&#x4EBA;&#x5176;&#x4E2D;&#x4E00;&#x4EBA;&#x624B;&#x4E2D;&#x5F97;&#x7968;&#x4F5C;&#x5E9F;&#x6389;&#x3002;&#x8FD9;&#x65F6;&#x5C31;&#x8981;&#x82B1;&#x8D39;&#x5F88;&#x5927;&#x7684;&#x529B;&#x6C14;&#x6765;&#x901A;&#x77E5;&#x540E;&#x4E70;&#x5230;&#x8FD9;&#x5F20;&#x7968;&#x7684;&#x4EBA;&#x8FD9;&#x4E2A;&#x6D88;&#x606F;&#x3002;&#x3002;&#x3002; &#x5982;&#x679C;&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x9700;&#x8981;&#x5728;A&#x4E70;&#x7968;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;B&#x53EA;&#x80FD;&#x7B49;&#x7740;&#x3002;&#x7B49;A&#x4E70;&#x7968;&#x7ED3;&#x675F;&#xFF0C;&#x5E76;&#x4E14;&#x628A;&#x4F59;&#x7968;&#x7ED3;&#x679C;&#x540C;&#x6B65;&#x5230;B&#x706B;&#x8F66;&#x7AD9;&#x7684;&#x552E;&#x7968;&#x7A97;&#x53E3;&#x3002;&#x7136;&#x540E;B&#x624D;&#x80FD;&#x77E5;&#x9053;&#x8FD8;&#x6709;&#x6CA1;&#x6709;&#x4F59;&#x7968;&#x53EF;&#x4EE5;&#x8D2D;&#x4E70;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x7684;&#x8BF4;&#x660E;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x5982;&#x679C;&#x60F3;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x5F71;&#x54CD;&#x5176;&#x6027;&#x80FD;&#x3002;&#x56E0;&#x4E3A;&#x5E76;&#x53D1;&#x7684;&#x5199;&#x8BF7;&#x6C42;&#x9700;&#x8981;&#x5728;&#x524D;&#x4E00;&#x4E2A;&#x5199;&#x8BF7;&#x6C42;&#x7ED3;&#x675F;&#x4E4B;&#x540E;&#x624D;&#x80FD;&#x8FDB;&#x884C;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x4F55;&#x80FD;&#x65E2;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x53C8;&#x4FDD;&#x8BC1;&#x7CFB;&#x7EDF;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x662F;&#x6BCF;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x90FD;&#x9700;&#x8981;&#x91CD;&#x70B9;&#x8003;&#x8651;&#x548C;&#x6743;&#x8861;&#x7684;&#x3002;&#x4E00;&#x81F4;&#x6027;&#x6A21;&#x578B;&#x53EF;&#x4EE5;&#x5728;&#x505A;&#x8FD9;&#x4E9B;&#x6743;&#x8861;&#x7684;&#x65F6;&#x5019;&#x7ED9;&#x6211;&#x4EEC;&#x5F88;&#x591A;&#x501F;&#x9274;&#x548C;&#x601D;&#x8003;&#x3002;</p>
<h2 id="&#x4E00;&#x81F4;&#x6027;&#x6A21;&#x578B;"><a href="#&#x4E00;&#x81F4;&#x6027;&#x6A21;&#x578B;" class="headerlink" title="&#x4E00;&#x81F4;&#x6027;&#x6A21;&#x578B;"></a>&#x4E00;&#x81F4;&#x6027;&#x6A21;&#x578B;</h2><h3 id="&#x5F3A;&#x4E00;&#x81F4;&#x6027;"><a href="#&#x5F3A;&#x4E00;&#x81F4;&#x6027;" class="headerlink" title="&#x5F3A;&#x4E00;&#x81F4;&#x6027;"></a>&#x5F3A;&#x4E00;&#x81F4;&#x6027;</h3><p>&#x5F53;&#x66F4;&#x65B0;&#x64CD;&#x4F5C;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#xFF0C;&#x4EFB;&#x4F55;&#x591A;&#x4E2A;&#x540E;&#x7EED;&#x8FDB;&#x7A0B;&#x6216;&#x8005;&#x7EBF;&#x7A0B;&#x7684;&#x8BBF;&#x95EE;&#x90FD;&#x4F1A;&#x8FD4;&#x56DE;&#x6700;&#x65B0;&#x7684;&#x66F4;&#x65B0;&#x8FC7;&#x7684;&#x503C;&#x3002;&#x8FD9;&#x79CD;&#x662F;&#x5BF9;&#x7528;&#x6237;&#x6700;&#x53CB;&#x597D;&#x7684;&#xFF0C;&#x5C31;&#x662F;&#x7528;&#x6237;&#x4E0A;&#x4E00;&#x6B21;&#x5199;&#x4EC0;&#x4E48;&#xFF0C;&#x4E0B;&#x4E00;&#x6B21;&#x5C31;&#x4FDD;&#x8BC1;&#x80FD;&#x8BFB;&#x5230;&#x4EC0;&#x4E48;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x5B9E;&#x73B0;&#x5BF9;&#x6027;&#x80FD;&#x5F71;&#x54CD;&#x8F83;&#x5927;&#x3002;</p>
<h3 id="&#x5F31;&#x4E00;&#x81F4;&#x6027;"><a href="#&#x5F31;&#x4E00;&#x81F4;&#x6027;" class="headerlink" title="&#x5F31;&#x4E00;&#x81F4;&#x6027;"></a>&#x5F31;&#x4E00;&#x81F4;&#x6027;</h3><p>&#x7CFB;&#x7EDF;&#x5E76;&#x4E0D;&#x4FDD;&#x8BC1;&#x7EED;&#x8FDB;&#x7A0B;&#x6216;&#x8005;&#x7EBF;&#x7A0B;&#x7684;&#x8BBF;&#x95EE;&#x90FD;&#x4F1A;&#x8FD4;&#x56DE;&#x6700;&#x65B0;&#x7684;&#x66F4;&#x65B0;&#x8FC7;&#x7684;&#x503C;&#x3002;&#x7CFB;&#x7EDF;&#x5728;&#x6570;&#x636E;&#x5199;&#x5165;&#x6210;&#x529F;&#x4E4B;&#x540E;&#xFF0C;&#x4E0D;&#x627F;&#x8BFA;&#x7ACB;&#x5373;&#x53EF;&#x4EE5;&#x8BFB;&#x5230;&#x6700;&#x65B0;&#x5199;&#x5165;&#x7684;&#x503C;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x5177;&#x4F53;&#x7684;&#x627F;&#x8BFA;&#x591A;&#x4E45;&#x4E4B;&#x540E;&#x53EF;&#x4EE5;&#x8BFB;&#x5230;&#x3002;&#x4F46;&#x4F1A;&#x5C3D;&#x53EF;&#x80FD;&#x4FDD;&#x8BC1;&#x5728;&#x67D0;&#x4E2A;&#x65F6;&#x95F4;&#x7EA7;&#x522B;&#xFF08;&#x6BD4;&#x5982;&#x79D2;&#x7EA7;&#x522B;&#xFF09;&#x4E4B;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x6570;&#x636E;&#x8FBE;&#x5230;&#x4E00;&#x81F4;&#x6027;&#x72B6;&#x6001;&#x3002;</p>
<h3 id="&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;"><a href="#&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;" class="headerlink" title="&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;"></a>&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;</h3><p>&#x5F31;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x7279;&#x5B9A;&#x5F62;&#x5F0F;&#x3002;&#x7CFB;&#x7EDF;&#x4FDD;&#x8BC1;&#x5728;&#x6CA1;&#x6709;&#x540E;&#x7EED;&#x66F4;&#x65B0;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x7CFB;&#x7EDF;&#x6700;&#x7EC8;&#x8FD4;&#x56DE;&#x4E0A;&#x4E00;&#x6B21;&#x66F4;&#x65B0;&#x64CD;&#x4F5C;&#x7684;&#x503C;&#x3002;&#x5728;&#x6CA1;&#x6709;&#x6545;&#x969C;&#x53D1;&#x751F;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x4E0D;&#x4E00;&#x81F4;&#x7A97;&#x53E3;&#x7684;&#x65F6;&#x95F4;&#x4E3B;&#x8981;&#x53D7;&#x901A;&#x4FE1;&#x5EF6;&#x8FDF;&#xFF0C;&#x7CFB;&#x7EDF;&#x8D1F;&#x8F7D;&#x548C;&#x590D;&#x5236;&#x526F;&#x672C;&#x7684;&#x4E2A;&#x6570;&#x5F71;&#x54CD;&#x3002;DNS&#x662F;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#x7CFB;&#x7EDF;&#x3002;</p>
<h3 id="&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#x6A21;&#x578B;&#x7684;&#x53D8;&#x79CD;"><a href="#&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#x6A21;&#x578B;&#x7684;&#x53D8;&#x79CD;" class="headerlink" title="&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#x6A21;&#x578B;&#x7684;&#x53D8;&#x79CD;"></a>&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#x6A21;&#x578B;&#x7684;&#x53D8;&#x79CD;</h3><ol>
<li><p>&#x56E0;&#x679C;&#x4E00;&#x81F4;&#x6027;&#xFF1A;&#x5982;&#x679C;A&#x8FDB;&#x7A0B;&#x5728;&#x66F4;&#x65B0;&#x4E4B;&#x540E;&#x5411;B&#x8FDB;&#x7A0B;&#x901A;&#x77E5;&#x66F4;&#x65B0;&#x7684;&#x5B8C;&#x6210;&#xFF0C;&#x90A3;&#x4E48;B&#x7684;&#x8BBF;&#x95EE;&#x64CD;&#x4F5C;&#x5C06;&#x4F1A;&#x8FD4;&#x56DE;&#x66F4;&#x65B0;&#x7684;&#x503C;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x56E0;&#x679C;&#x5173;&#x7CFB;&#x7684;C&#x8FDB;&#x7A0B;&#x5C06;&#x4F1A;&#x9075;&#x5FAA;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x89C4;&#x5219;&#x3002;</p>
</li>
<li><p>&#x8BFB;&#x5DF1;&#x6240;&#x5199;&#x4E00;&#x81F4;&#x6027;&#xFF1A;&#x56E0;&#x679C;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x7279;&#x5B9A;&#x5F62;&#x5F0F;&#x3002;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x603B;&#x53EF;&#x4EE5;&#x8BFB;&#x5230;&#x81EA;&#x5DF1;&#x66F4;&#x65B0;&#x7684;&#x6570;&#x636E;&#x3002;</p>
</li>
<li><p>&#x4F1A;&#x8BDD;&#x4E00;&#x81F4;&#x6027;&#xFF1A;&#x8BFB;&#x5DF1;&#x6240;&#x5199;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x7279;&#x5B9A;&#x5F62;&#x5F0F;&#x3002;&#x8FDB;&#x7A0B;&#x5728;&#x8BBF;&#x95EE;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x540C;&#x4E00;&#x4E2A;&#x4F1A;&#x8BDD;&#x5185;&#xFF0C;&#x7CFB;&#x7EDF;&#x4FDD;&#x8BC1;&#x8BE5;&#x8FDB;&#x7A0B;&#x8BFB;&#x5DF1;&#x4E4B;&#x6240;&#x5199;&#x3002;</p>
</li>
<li><p>&#x5355;&#x8C03;&#x8BFB;&#x4E00;&#x81F4;&#x6027;&#xFF1A;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x5DF2;&#x7ECF;&#x8BFB;&#x53D6;&#x5230;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x503C;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x8FDB;&#x7A0B;&#x4E0D;&#x4F1A;&#x8BFB;&#x53D6;&#x5230;&#x8BE5;&#x503C;&#x4EE5;&#x524D;&#x7684;&#x4EFB;&#x4F55;&#x503C;&#x3002;</p>
</li>
<li><p>&#x5355;&#x8C03;&#x5199;&#x4E00;&#x81F4;&#x6027;&#xFF1A;&#x7CFB;&#x7EDF;&#x4FDD;&#x8BC1;&#x5BF9;&#x540C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x5199;&#x64CD;&#x4F5C;&#x4E32;&#x884C;&#x5316;&#x3002;</p>
</li>
</ol>
<p>&#x4E0A;&#x8FF0;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x4E0D;&#x540C;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x7EC4;&#x5408;&#xFF0C;&#x4F8B;&#x5982;&#x5355;&#x8C03;&#x8BFB;&#x4E00;&#x81F4;&#x6027;&#x548C;&#x8BFB;&#x5DF1;&#x4E4B;&#x6240;&#x5199;&#x4E00;&#x81F4;&#x6027;&#x5C31;&#x53EF;&#x4EE5;&#x7EC4;&#x5408;&#x5B9E;&#x73B0;&#x3002;&#x5E76;&#x4E14;&#x4ECE;&#x5B9E;&#x8DF5;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x8FD9;&#x4E24;&#x8005;&#x7684;&#x7EC4;&#x5408;&#xFF0C;&#x8BFB;&#x53D6;&#x81EA;&#x5DF1;&#x66F4;&#x65B0;&#x7684; &#x6570;&#x636E;&#xFF0C;&#x548C;&#x4E00;&#x65E6;&#x8BFB;&#x53D6;&#x5230;&#x6700;&#x65B0;&#x7684;&#x7248;&#x672C;&#x4E0D;&#x4F1A;&#x518D;&#x8BFB;&#x53D6;&#x65E7;&#x7248;&#x672C;&#xFF0C;&#x5BF9;&#x4E8E;&#x6B64;&#x67B6;&#x6784;&#x4E0A;&#x7684;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x6765;&#x8BF4;&#xFF0C;&#x4F1A;&#x5C11;&#x5F88;&#x591A;&#x989D;&#x5916;&#x7684;&#x70E6;&#x607C;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x95EE;&#x9898;&#xFF0C;&#x5728;&#x957F;&#x671F;&#x7684;&#x7814;&#x7A76;&#x63A2;&#x7D22;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6D8C;&#x73B0;&#x51FA;&#x4E86;&#x4E00;&#x5927;&#x6279;&#x7ECF;&#x5178;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x534F;&#x8BAE;&#x548C;&#x7B97;&#x6CD5;&#xFF0C;&#x5176;&#x4E2D;&#x6BD4;&#x8F83;&#x8457;&#x540D;&#x7684;&#x6709;&#x4E8C;&#x9636;&#x6BB5;&#x63D0;&#x4EA4;&#x534F;&#x8BAE;&#xFF0C;&#x4E09;&#x9636;&#x6BB5;&#x63D0;&#x4EA4;&#x534F;&#x8BAE;&#x548C;Paxos&#x7B97;&#x6CD5;&#x3002; &#x4E0B;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x5C06;&#x4ECB;&#x7ECD;&#x8FD9;&#x4E9B;&#x548C;&#x5206;&#x5E03;&#x5F0F;&#x4E00;&#x81F4;&#x6027;&#x76F8;&#x5173;&#x7684;&#x534F;&#x8BAE;&#x548C;&#x7B97;&#x6CD5;&#x3002;</p>
<h2 id="&#x8D44;&#x6599;"><a href="#&#x8D44;&#x6599;" class="headerlink" title="&#x8D44;&#x6599;"></a>&#x8D44;&#x6599;</h2><ul>
<li>&#x6CE8;&#xFF1A;&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;<a href="http://www.hollischuang.com/archives/663" target="_blank" rel="external">http://www.hollischuang.com/archives/663</a></li>
</ul>

      
    </div>
    
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2016/08/22/jquery-eval-paesing-json-introduce/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption"><</strong>
      <div class="article-nav-title">
        
          jquery eval解析JSON中的注意点介绍
        
      </div>
    </a>
  
  
    <a href="/2016/08/08/初识分布式系统/" id="article-nav-older" class="article-nav-link-wrap">
      <div class="article-nav-title">初识分布式系统</div>
      <strong class="article-nav-caption">></strong>
    </a>
  
</nav>

  
</article>


<div class="share_jia">
	<!-- JiaThis Button BEGIN -->
	<div class="jiathis_style">
		<span class="jiathis_txt">Share to: &nbsp; </span>
		<a class="jiathis_button_facebook"></a> 
    <a class="jiathis_button_twitter"></a>
    <a class="jiathis_button_plus"></a> 
    <a class="jiathis_button_tsina"></a>
		<a class="jiathis_button_cqq"></a>
		<a class="jiathis_button_douban"></a>
		<a class="jiathis_button_weixin"></a>
		<a class="jiathis_button_tumblr"></a>
    <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
	</div>
	<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js?uid=1405949716054953" charset="utf-8"></script>
	<!-- JiaThis Button END -->
</div>






<div class="duoshuo">
	<!-- 多说评论框 start -->
	<div class="ds-thread" data-thread-key="关于分布式一致性的探究" data-title="关于分布式一致性的探究" data-url="http://code.skyheng.com/2016/08/08/关于分布式一致性的探究/"></div>
	<!-- 多说评论框 end -->
	<!-- 多说公共JS代码 start (一个网页只需插入一次) -->
	<script type="text/javascript">
	var duoshuoQuery = {short_name:"true"};
	(function() {
		var ds = document.createElement('script');
		ds.type = 'text/javascript';ds.async = true;
		ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
		ds.charset = 'UTF-8';
		(document.getElementsByTagName('head')[0] 
		 || document.getElementsByTagName('body')[0]).appendChild(ds);
	})();
	</script>
	<!-- 多说公共JS代码 end -->
</div>




</div>
      <footer id="footer">
  <div class="outer">
    <div id="footer-info">
    	<div class="footer-left">
    		&copy; 2016 Chenjh
    	</div>
      	<div class="footer-right">
      		<a href="http://hexo.io/" target="_blank">Hexo</a>  Theme <a href="https://github.com/litten/hexo-theme-yilia" target="_blank">Yilia</a> by Litten
      	</div>
    </div>
  </div>
</footer>
    </div>
    
  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">


<script>
	var yiliaConfig = {
		fancybox: true,
		mathjax: true,
		animate: true,
		isHome: false,
		isPost: true,
		isArchive: false,
		isTag: false,
		isCategory: false,
		open_in_new: false,
		root: /
	}
</script>
<script src="http://7.url.cn/edu/jslib/comb/require-2.1.6,jquery-1.9.1.min.js"></script>
<script src="/js/main.js"></script>






<script type="text/x-mathjax-config">
MathJax.Hub.Config({
    tex2jax: {
        inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
        processEscapes: true,
        skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
    }
});

MathJax.Hub.Queue(function() {
    var all = MathJax.Hub.getAllJax(), i;
    for(i=0; i < all.length; i += 1) {
        all[i].SourceElement().parentNode.className += ' has-jax';                 
    }       
});
</script>

<script type="text/javascript" src="http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>


  </div>
</body>
</html>